art_share/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:user_id)
            @artworks = Artwork.where(artist_id: params[:user_id])
        else
        @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 8]]