art_share/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "artworks"."artist_id" = $1 AND "artworks"."artist_id" IS NULL  [["artist_id", 2]]
---
    def index
        if params.has_key?(:user_id)
            @artworks = Artwork
                                .left_outer_joins(:shared_viewers)
                                .where("artworks.artist_id = ? OR artwork_shares.viewer_id = ?", params[:user_id], params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1 WHERE "artworks"."id" = $2  [["image_url", "www.StarryNight.com"], ["id", 9]]
---
    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)