art_share/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
---
    def index
        if params.has_key?(:user_id)
            @comments = Comment.where(commenter_id: params[:user_id])
            render json:@comments
        elsif params.has_key?(:artwork_id)
            @comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter_id", 1], ["artwork_id", 1], ["body", "i dont like this one"], ["created_at", "2022-06-30 20:10:53.825567"], ["updated_at", "2022-06-30 20:10:53.825567"]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.save