art_share/app/controllers/likes_controller.rb

    def destroy
        @like = Like.find(params[:id])
        @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]