art_share/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE 'Ta%')
SELECT "users".* FROM "users"
SELECT  1 AS one FROM "users" WHERE (username LIKE ''Ta'%') LIMIT $1  [["LIMIT", 1]]
---
    def index
        if params.has_key?(:username)
            @users = User.where("username LIKE ?", "#{params[:username]}%")
                if @users.empty?
                    render json: user.errors.full_messages, status: :unprocessable_entity
                end
            render json:@users
        else
            @users = User.all